{
    "frames": {
       "signpost": {
            "kind": "exp-lookit-instructions",                        
            "blocks": [
                {
                    "title": "What will happen in this study?",
                    "text": "<b>Important: Your child doesn't need to be with you yet. It's fine if your child is playing nearby until the videos start</b>.<br /><br />Here's what will happen in this study:",
                    "listblocks": [
                        {
                          "text": "Consent form: You'll read some information about the study. If you want to participate, you'll read a statement aloud to agree."
                        },
                        {
                          "text": "Instructions and preview: We'll give you some more information about what to expect."
                        },
                        {
                          "text": "Setup: You'll test your speakers and get your child positioned in from the the screen to watch the videos."
                        },
                        {
                          "text": "The actual study: Your child will watch some video and then you and your child will read a storybook together."
                        },
                        {
                          "text": "Wrap-up: You can choose a privacy level for your videos, enter any feedback you have about the study, and receive a brief explanation of what we are looking at specifically in this study."
                        }
                    ]
                },                
                {
                    "text": "Note that in video instructions, we will address you as \"big person\". This is because both parents and legal guardians can serve as adults in LookIt."
                    
                },
                {
                    "text": "When you are ready to continue, click Next."
                    
                }
            ],
            "nextButtonText": "Next",
            "displayFullscreenOverride": false,
            "showPreviousButton": false
        },
        "video-config": {
            "kind": "exp-video-config",
            "troubleshootingIntro": "",
            "displayFullscreenOverride": true
        },
        "video-consent": {
            "kind": "exp-lookit-video-consent",
            "PIName": "Dr. Elika Bergelson",
            "datause": "We are interested in what your child knows about basic grammatical rules in the English language, both what they say as well as what they seem to understand. A research assistant will watch the videos recorded from the first part of the experiment as your child looks at different objects onscreen; another will review the recording from when you and your child read the storybook together and annotate what your child said in response to questions you ask them.",
            "payment": "After you finish the study, we will email you a $10 Amazon gift card within approximately three days. To be eligible for the gift card your child must be in the age range for this study, you need to submit a valid consent statement, and we need to see that there is a child with you. But we will send a gift card even if you do not finish the whole study or we are not able to use your child's data! There are no other direct benefits to you or your child from participating, but we hope you will enjoy the experience.",
            "purpose": "This study looks at what children between two and three years old know about basic grammatical distinctions in English.",
            "PIContact": "Dr. Stephan Meylan (on behalf of Dr. Bergelson) 727 278 1398",
            "procedures": "In this study, you and your child will view a series of videos, about 12 minutes long in total, where a speaker in the video will name new and familiar objects that will appear onscreen. Then you will read a 'storybook' to your child which has more new and familiar objects. For both parts, LookIt will record both video and audio through your web broswer. There will be more specific instructions for each portion of the study. There are no anticipated risks associated with participating.",
            "institution": "Duke University",
            "displayFullscreenOverride": true
        },
        "start-video": {
           "kind": "exp-lookit-video",
           "video": {
               "top": 10,
               "left": 0,
               "loop": false,
               "width": 80,
               "source": "start-video",
               "position": "fill"
           },
           "backgroundColor": "white",
           "autoProceed": false,
           "parentTextBlock": {
               "text": "If your child needs a break, just press Space to pause!"
           },
           "requiredDuration": 0,
           "requireAudioCount": 0,
           "requireVideoCount": 1,
           "restartAfterPause": true,
           "pauseKey": " ",
           "pauseKeyDescription": "space",
           "pauseAudio": "pause",
           "pauseVideo": "attentiongrabber",
           "pauseText": "(You'll have a moment to get ready before recording starts again.)",
           "unpauseAudio": "return_after_pause",
           "doRecording": false,
           "baseDir": "https://umzy19bu4.ddns.net/plearn/order1/",
           "videoTypes": [
               "webm",
               "mp4"
           ],
           "displayFullscreenOverride": true
       },        
        "instructions-gazetracking": {
            "kind": "exp-lookit-instructions",            
            "blocks": [
                {
                    "title": "Part 1: Watch Some Videos",
                    "text": "This experiment has two sections. In the first section, your child will watch a series of videos where someone will ask your child to find something onscreen. We will start with instructions for the videos, and return to the storybook in a second.",
                    "listblocks": [
                        {
                          "text": "You may decide how to best position you and your child in front of the camera. Ideally <b>your child will be centered in the video feed, facing towards the camera, and about two feet (one adult arm’s distance) away from the camera</b>. This makes it easier for us to tell where your child is looking on the screen during the videos. We will provide more instructions when it is time to get your child ready to participate."
                        },
                        {
                          "text": "As the parent or caregiver, you should <b>close your eyes during the test videos</b>. This way you won't introduce subtle cues for your child about where to look. If your child looks back to engage you (many kids do this when they see new things), feel free to look back at them and share in their excitement, but try not to look at the screen or engage your child in conversation. The first four trials will be practice trials, so you can have your eyes open and we will remind you for the test trials."
                        },                        
                        {
                          "text": "<b>Please do not repeat back the new words or phrases.</b> If your child becomes distracted, you may say something like, \"let's watch the video!\""
                        },
                         {
                            "text": "If you need to stop for any reason during the videos just press the space bar. This will pause the experiment for as long as you need."
                        }
                        
                    ]
                },
                {
                    "text" : "On the next page we will explain the storybook task. When you are ready to learn about that, click Next."
                }
            ],
            "nextButtonText": "Next",
            "displayFullscreenOverride": true
        },   
        "sample-calibration-trial": {
            "kind": "exp-lookit-composite-video-trial",
            "isLast": false,
            "baseDir": "https://umzy19bu4.ddns.net/plearn/order1/",
            "sources": "16",
            "testCount": 1,
            "altSources": "16",            
            "pauseAudio": "pause",
            "videoTypes": [
                "webm",
                "mp4"
            ],           
            "startRecordingAutomatically": true,  
            "attnSources": "attentiongrabber",            
            "musicSources": "16",
            "unpauseAudio": "return_after_pause",
            "announceLength": 0,
            "backgroundColor": "black",
            "calibrationLength": 3000,
            "calibrationAudioSources": "chimes",
            "calibrationVideoSources": "attentiongrabber",
            "maxUploadSeconds": 120
        },             
        "sample-intermodal-trial-2": {
            "kind": "exp-lookit-video",
            "video": {
              "loop": false,
              "source": "16"
            },
            "requiredDuration": 0,
            "requireAudioCount": 0,
            "requireVideoCount": 1,
            "restartAfterPause": true,
           "pauseKey": " ",
           "pauseKeyDescription": "Space",
           "pauseAudio": "pause",
           "pauseVideo": "attentiongrabber",
           "pauseText": "(You'll have a moment to turn around again.)",
           "unpauseAudio": "return_after_pause",            
           "baseDir": "https://umzy19bu4.ddns.net/plearn/order1/",     
            "pauseAudio": "pause",
            "videoTypes": [
                "webm",
                "mp4"
            ],           
            "doRecording": true,
            "startRecordingAutomatically": true,            
            "backgroundColor": "white",
            "maxUploadSeconds": 120
        },
        "sample-intermodal-trial-3": {
            "kind": "exp-lookit-video",
            "video": {
              "loop": false,
              "source": "5"
            },
            "requiredDuration": 0,
            "requireAudioCount": 0,
            "requireVideoCount": 1,
            "restartAfterPause": true,
           "pauseKey": " ",
           "pauseKeyDescription": "Space",
           "pauseAudio": "pause",
           "pauseVideo": "attentiongrabber",
           "pauseText": "(You'll have a moment to turn around again.)",
           "unpauseAudio": "return_after_pause",            
           "baseDir": "https://umzy19bu4.ddns.net/plearn/order1/",     
            "pauseAudio": "pause",
            "videoTypes": [
                "webm",
                "mp4"
            ],           
            "doRecording": true,
            "startRecordingAutomatically": true,            
            "backgroundColor": "white",
            "maxUploadSeconds": 120
        },
        "end-practice-begin-test-video": {
           "kind": "exp-lookit-video",
           "video": {
               "top": 10,
               "left": 0,
               "loop": false,
               "width": 80,
               "source": "end-practice-begin-test-video",
               "position": "fill"
           },
           "backgroundColor": "white",
           "autoProceed": false,
           "parentTextBlock": {
               "text": "If your child needs a break, just press Space to pause!"
           },
           "requiredDuration": 0,
           "requireAudioCount": 0,
           "requireVideoCount": 1,
           "restartAfterPause": true,
           "pauseKey": " ",
           "pauseKeyDescription": "space",
           "pauseAudio": "pause",
           "pauseVideo": "attentiongrabber",
           "pauseText": "(You'll have a moment to get ready before recording starts again.)",
           "unpauseAudio": "return_after_pause",
           "doRecording": false,
           "baseDir": "https://umzy19bu4.ddns.net/plearn/order1/",
           "videoTypes": [
               "webm",
               "mp4"
           ]
       },
        "end-gazetracking-begin-storybook-video": {
           "kind": "exp-lookit-video",
           "video": {
               "top": 10,
               "left": 0,
               "loop": false,
               "width": 80,
               "source": "end-gazetracking-begin-storybook-video",
               "position": "fill"
           },
           "backgroundColor": "white",
           "autoProceed": false,
           "parentTextBlock": {
               "text": "If your child needs a break, just press Space to pause!"
           },
           "requiredDuration": 0,
           "requireAudioCount": 0,
           "requireVideoCount": 1,
           "restartAfterPause": true,
           "pauseKey": " ",
           "pauseKeyDescription": "space",
           "pauseAudio": "pause",
           "pauseVideo": "attentiongrabber",
           "pauseText": "(You'll have a moment to get ready before recording starts again.)",
           "unpauseAudio": "return_after_pause",
           "doRecording": false,
           "baseDir": "https://umzy19bu4.ddns.net/plearn/order1/",
           "videoTypes": [
               "webm",
               "mp4"
           ]
       },
         "instructions-storybook-intro": {
            "kind": "exp-lookit-instructions",
            "blocks": [
                {
                    "title": "Part 2: Read a Storybook",
                    "text": "In the second part of this experiment, you and your child will read a storybook together. The goal of the storybook is to get your child to name the animals and objects that appear on the pages. In each case, you will name one first. <b>We will show you these instructions again as a reminder at the beginning of the storybook section,</b> but again we wanted to give you the instructions now so that you can take time to read them slowly.",
                    "listblocks": [
                        {
                            "text": "We need to be able to <b>hear both you and your child</b>, so stay close to the microphone."
                        },
                        {
                            "text": "Each storybook page will have written text at the bottom. Please read this text to your child <b>as you might normally read a storybook together</b>."
                        },
                        {
                            "text": "Some storybook pages will have familiar objects and animals on them. Other pages will have <b>new objects and animals</b> that neither you nor your child have never heard of before, because we made them up. Just a heads up so they don't surprise you! If you are unsure how to pronounce it, <b>your best guess about pronunciation is fine.</b>"
                        },
                        {
                            "text": "Whenever there is <b>one of an object or animal</b> onscreen, feel free to improvise to engage your child (look, a dog!). Whenever there are <b>two of an object or animal</b> onscreen, please read the text below exactly as written. You may repeat it if necessary."
                        },
                        {
                            "text": "Whatever your child's respose, please respond to them with <b>\"great job!\"</b>. If they provide a different name for an object before you read it (for example, \"jacket\" when the storybook says \"coat\"), you may proceed using the child's word. <b>Please do not correct your child's response, or ask your child to count the objects onscreen.</b>"
                        },
                        {
                            "text": "If your child is giving you the silent treatment or is temporarily fussy (such that you think they might get into the story if you keep going), you can <b>move on after about 15 seconds</b> on each page (by your judgment)."
                        }

                       
                    ]
                },
                {
                    "text": "There's more information on the next page, so when you are ready click Next."
                }
            ],
            "showWebcam": false,            
            "nextButtonText": "Next",
            "displayFullscreenOverride": true            
        },
        "instructions-storybook-addition": {
            "kind": "exp-lookit-instructions",
            "blocks": [
                {
                    "title": "One more point...",
                    "text": "No more instructions, but we there's something we wanted you to know: This experiment is for an age range where language knowledge changes very quickly, so <b>this storybook part might seem much too difficult or much too easy</b>. If your child has nothing to say, or says things that are differently than an adult, this is perfectly fine! Also if this seems very easy and you are done in just a few minutes, that's fine too!<br /><br /> When you are ready to check the video feed to make sure your child is in the right position, click Next."
                }
            ],
            "nextButtonText": "Next",
            "displayFullscreenOverride": true
        },
        "audio-test-at-start": {
          "kind": "exp-lookit-instructions",          
            "blocks": [
              {
                "text": "Please try playing this sample audio to make sure you'll be able to hear the videos.",
                "title": "Adjust your speakers",
                "mediaBlock": {
                  "text": "You should hear 'Ready to go?'",
                  "isVideo": false,
                  "sources": [
                    {
                      "src": "https://s3.amazonaws.com/lookitcontents/exp-physics-final/audio/ready.mp3",
                      "type": "audio/mp3"
                    },
                    {
                      "src": "https://s3.amazonaws.com/lookitcontents/exp-physics-final/audio/ready.ogg",
                      "type": "audio/ogg"
                    }
                  ],
                  "mustPlay": true,
                  "warningText": "Please try playing the sample audio."
                }
              },
              {
                "text": "When you are ready to move on to instructions on how to position you and your child, click Next."
              }
          ],
          "nextButtonText": "Next",
          "displayFullscreenOverride": true         
        },
        "positioning-instructions": {
          "kind": "exp-lookit-instructions",          
            "blocks": [
              {
                  "title": "Position you and your child",
                  "text": "Now is the time to decide how to position you and your child in front of the camera. Ideally <b>your child will be centered in the video feed, facing towards the camera, and about two feet (one adult arm’s distance) away from the camera</b>. Some setups that we have found work well are:",
                    "listblocks": [
                        {"text": "Put your child in your lap"},
                        {"text": "Put your child in a high chair (for younger children) and sit alongside them"},
                        {"text": "Put your child in a booster seat (for older children) and sit alongside them"},
                        {"text": "If you have a laptop, both you and your child sit on the ground, and put your laptop on a coffee table"}                
                    ]
              }
          ],
          "showWebcam": true,
          "webcamBlocks": [
            {
              "title": "Make sure we can see you",
              "listblocks": [
                {
                  "text": "Take a look at your webcam view above. Get comfy, and adjust your own position or the computer as needed so both you and your child are visible."
                },
                {
                  "text": "This isn't a Skype call - no one in the lab can see you - but the recorded video of your participation will be sent to the lab to help with data analysis. It's helpful for us to be able to see if your child was pointing or looking confused, for example."
                },
                {
                  "text": "When you are ready to begin, click Start the Videos"
                }
              ]
            }
          ],
          "nextButtonText": "Start the Videos",
          "displayFullscreenOverride": true
        },
        "instructions-storybook-repeat": {
          "kind": "exp-lookit-instructions",
            "blocks": [
              {
                  "title": "Part 2: Read a Storybook",
                  "text": " As a reminder, in this second (and final) part of this experiment, you and your child will read a storybook together. The goal of the storybook is to get your child to name the animals and objects that appear on the pages. In each case, you will name an object or animal, and get them to say the name of the animal. You will then ask them to provide a name for two of that object or thing.",
                  "listblocks": [
                      {
                          "text": "Each storybook page will have written text at the bottom. Please read this text to your child <b>as you might normally read a storybook together</b>."
                      },
                      {
                          "text": "Some storybook pages will have familiar objects and animals on them. Other pages will have <b>new objects and animals</b> that neither you nor your child have never heard of before, because we made them up. Just a heads up so they don't surprise you! If you are unsure how to pronounce it, <b>your best guess about pronunciation is fine.</b>"
                      },
                      {
                          "text": "Whenever there is <b>one of an object or animal</b> onscreen, feel free to improvise to engage your child (look, a dog!). Whenever there are <b>two of an object or animal</b> onscreen, please read the text below exactly as written. You may repeat it if necessary."
                      },
                      {
                          "text": "Whatever your child's respose, please respond to them with <b>\"great job!\"</b>. If they provide a different name for an object before you read it (for example, \"jacket\" when the storybook says \"coat\"), you may proceed using the child's word. <b>Please do not correct your child's response, or ask your child to count the objects onscreen.</b>"
                      },
                      {
                          "text": "If your child is giving you the silent treatment or is temporarily fussy (such that you think they might get into the story if you keep going), you can <b>move on after about 15 seconds</b> on each page (by your judgment)."
                      }
                  ]
              },
              {
                  "text": "One more thing about the storybook... click Next to continue."
              }                
          ],
          "nextButtonText": "Next",
          "displayFullscreenOverride": true        
        },
        "storybook-positioning-test": {
          "kind": "exp-lookit-instructions",
          "showWebcam": true,
          "webcamBlocks": [
            {
              "title" : "Can we still see your child?",
              "text": "Make sure that we can still see your child. We need to be able to <b>hear both you and your child</b>, so stay close to the microphone. When you are ready to start the storybook, click the button below."
            }
          ],
          "nextButtonText": "Start the Storybook",
          "displayFullscreenOverride": true
        },
        "gazetracking-position-check-video": {
           "kind": "exp-lookit-video",
           "video": {
               "top": 10,
               "left": 0,
               "loop": false,
               "width": 80,
               "source": "gazetracking-position-check-video",
               "position": "fill"
           },
           "backgroundColor": "white",
           "autoProceed": true,
           "parentTextBlock": {
               "text": "If your child needs a break, just press Space to pause!"
           },
           "requiredDuration": 0,
           "requireAudioCount": 0,
           "requireVideoCount": 1,
           "restartAfterPause": true,
           "pauseKey": " ",
           "pauseKeyDescription": "space",
           "pauseAudio": "pause",
           "pauseVideo": "attentiongrabber",
           "pauseText": "(You'll have a moment to get ready before recording starts again.)",
           "unpauseAudio": "return_after_pause",
           "doRecording": false,
           "baseDir": "https://umzy19bu4.ddns.net/plearn/order1/",
           "videoTypes": [
               "webm",
               "mp4"
           ]
       },
       "gazetracking-position-check": {
            "kind": "exp-lookit-instructions",
            "blocks": [
                {
                    "title": "Can the camera see your child?",
                    "text": "Please make sure that the camera can still see where your child is looking. When you are ready to continue, click next and please <b>close your eyes again</b>!"
                }
            ],
            "showWebcam": true,
            "webcamBlocks": [
                {
                    "title": ""
                }
            ],
            "nextButtonText": "Next",
            "displayFullscreenOverride": true
        },
        "start-video-recording": {
            "kind": "exp-lookit-start-recording",
            "baseDir": "https://umzy19bu4.ddns.net/plearn/order1/",
            "videoTypes": [
                "webm",
                "mp4"
            ],
            "video": "attentiongrabber",
            "displayFullscreen": true
        },        
        "start-video-recording": {
            "kind": "exp-lookit-start-recording",
            "baseDir": "https://umzy19bu4.ddns.net/plearn/order1/",
            "videoTypes": [
                "webm",
                "mp4"
            ],
            "video": "attentiongrabber",
            "displayFullscreen": true
        },
        "storybook-plearn": {
            "kind": "group",
            "frameList": [
                {
                    "images": [
                        {
                            "id": "storybookIllustration",
                            "src": "10_cow_0.png",
                            "top": 0,
                            "left": 0,
                            "height": 100
                        }
                    ],
                    "parentTextBlock": {
                        "css": {
                            "font-size": "1.5em"
                        },
                        "text": "Look, a cow, can you say 'cow'?",
                        "title": "Big person reads to child..."
                    }
                },
                {
                    "images": [
                        {
                            "id": "storybookIllustration",
                            "src": "10_cow_1.png",
                            "top": 0,
                            "left": 0,
                            "height": 100
                        }
                    ],
                    "parentTextBlock": {
                        "css": {
                            "font-size": "1.5em"
                        },
                        "text": "What's here?",
                        "title": "Big person reads to child..."
                    }
                }
            ],
            "commonFrameProperties": {
                "kind": "exp-lookit-images-audio",
                "baseDir": "https://umzy19bu4.ddns.net/plearn/order1/",
                "audioTypes": [
                    "mp3",
                    "ogg"
                ],
                "autoProceed": false,
                "doRecording": false,
                "parentTextBlock": {
                    "css": {
                        "font-size": "1.5em"
                    },
                    "text": "FIXME",
                    "title": "For parents"
                },
                "maxUploadSeconds": 120
            }
        },        
        "stop-video-capture": {
            "kind": "exp-lookit-stop-recording",
            "baseDir": "https://umzy19bu4.ddns.net/plearn/order1/",
            "videoTypes": [
                "webm",
                "mp4"
            ],
            "video": "attentiongrabber",
            "displayFullscreen": true
        },
        "end-video": {
           "kind": "exp-lookit-video",
           "video": {
               "top": 10,
               "left": 0,
               "loop": false,
               "width": 80,
               "source": "end-video",
               "position": "fill"
           },
           "backgroundColor": "white",
           "autoProceed": true,
           "parentTextBlock": {
               "text": "If your child needs a break, just press Space to pause!"
           },
           "requiredDuration": 0,
           "requireAudioCount": 0,
           "requireVideoCount": 1,
           "restartAfterPause": true,
           "pauseKey": " ",
           "pauseKeyDescription": "space",
           "pauseAudio": "pause",
           "pauseVideo": "attentiongrabber",
           "pauseText": "(You'll have a moment to get ready before recording starts again.)",
           "unpauseAudio": "return_after_pause",
           "doRecording": false,
           "baseDir": "https://umzy19bu4.ddns.net/plearn/order1/",           
           "videoTypes": [
               "webm",
               "mp4"
           ]
       },
        "exit-survey": {
            "kind": "exp-lookit-exit-survey",
            "debriefing": {
                "text": "In this study, we look at what children know about the English singular and plural, for example dog vs. dogs, and cat vs. cats. While this is a common distinction made by adult speakers, as well as older children, when children first begin to understand this distinction is an important open question in child language research. Specifically, it is important because it is one of the first times that children learn to combine words and , including new words that they have never heard before: if an object is called 'a wug', then two of those things are called 'wugs'. While children end up learning many such rules, this may be the first one, so it is important to learn when they start to understand it in speech from others, as well as how they use it in their own speech.<br><br> Previous studies point to a surprising result:  English-learning children use the plural in their own speech (like in the storybook) before they 'understand' it -- that is, can successfully identify what a speaker is talking about (like in the videos here).  The key to this counter-intuitive result may be that children can use the plural to identify what a speaker is talking about  <i>only</i>  when there are other parts of the sentence that correspond to number ('there <b>are</b> <b>two</b> dogs'), and it might take them a while to learn that the presence of an 's' indicates the plural. This would mean that children are learning grammar first, then using that to learn the sound system! This is backwards from what researchers first thought (children learn sounds, then words, then grammar). If you want to watch a 5-minute scientific talk on a previous version of this experiment, look at this <a href=\"https://www.youtube.com/watch?v=pWF743dBlTI\" target=\"_blank\">YouTube video</a>. <br><br> Thanks again for your participation! We will email you a $10 Amazon gift card within approximately three days. To be eligible for the gift card your child must be in the age range for this study, you need to submit a valid consent statement, and we need to see that there is a child with you. But we will send a gift card even if you do not finish the whole study or we are not able to use your child's data!",
                "title": "Thank you!"
            },
            "showShareButton": false
        }
    },    
    "sequence": [
        "signpost",
        "video-config",
        "video-consent",
        "instructions-gazetracking",
        "instructions-storybook-intro",
        "positioning-instructions",
        "audio-test-at-start",
        "positioning-instructions",
        "start-video",
        "end-practice-begin-test-video",        
        "sample-intermodal-trial-2",
        "sample-intermodal-trial-3",
        "end-gazetracking-begin-storybook-video",        
        "instructions-storybook-repeat",
        "instructions-storybook-addition",
        "storybook-positioning-test",
        "storybook-plearn",
        "end-video",
        "exit-survey"
    ]
}